MAX_SLICE = 50
"""Максимальное количество элементов для среза."""

LENGTH_RECIPE_NAME = 256
"""Максимальная длина названия рецепта."""

LENGTH_TAG_NAME = 24
"""Максимальная длина имени тега."""

LENGTH_EMAIL = 254
"""Максимальная длина email адреса."""

LENGTH_NAME = 150
"""Максимальная длина имени пользователя."""

LENGTH_SLUG = 50
"""Максимальная длина slug (читаемого URL)."""

LENGTH_INGREDIENT_NAME = 128
"""Максимальная длина названия ингредиента."""

MEASUREMENT_UNIT_LENGTH = 15
"""Максимальная длина единицы измерения."""

DEFAULT_PAGINATION_LIMIT = 6
"""Параметр пагинации страниц."""
